src/cf/Enums/НаправленияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
					<Comment>Внутри организации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ДействияПоЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДействияПоЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузитьПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытьПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьОтправку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенаправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переформировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьСУтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОбменСКонтрагентамиИнтеграцияКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ОтразитьДокументВУчете(ОповещениеОкончанияОтраженияВУчете, ОписаниеПакета, ОбъектыУчета, Контрагент, СпособОбработки) Экспорт
	
	Если Не ИнтеграцияЭДОКлиент.ЕстьПодсистемаОтражениеВУчетеЭДО() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодульОтражениеВУчетеЭДОКлиент = ИнтеграцияЭДОКлиент.ОбщийМодульОтражениеВУчетеЭДОКлиент();
	
	ДанныеДокументооборота = ОбщийМодульОтражениеВУчетеЭДОКлиент.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете();		
	ДанныеДокументооборота.ВидДокумента = ОписаниеПакета.Содержание.ВидДокумента;
	ДанныеДокументооборота.ТипДокумента = ОписаниеПакета.Содержание.ТипДокумента;
	ДанныеДокументооборота.ДанныеОсновногоФайла = ОписаниеПакета.ДанныеОсновногоФайла;
	ДанныеДокументооборота.ДанныеДополнительногоФайла = ОписаниеПакета.ДанныеФайлаДопДанных;
	ДанныеДокументооборота.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий");
	ДанныеДокументооборота.Отправитель = Контрагент;
		
	ОбщийМодульОтражениеВУчетеЭДОКлиент.НачатьОтражениеДокументаВУчете(ОповещениеОкончанияОтраженияВУчете,
		ДанныеДокументооборота, ОбъектыУчета, СпособОбработки);	
	
КонецПроцедуры

Процедура ОткрытьДокументооборот(Документооборот, ТолькоПросмотр = Ложь) Экспорт
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокумент(Документооборот, ТолькоПросмотр);
КонецПроцедуры

Процедура ПодписатьОтправитьДокументыПоЭДО(ОповещениеОЗавершении, Документообороты) Экспорт
	ПараметрыВыполнения = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.Документообороты = Документообороты;
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Подписать"));
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить"));
	ИнтерфейсДокументовЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеОЗавершении, ПараметрыВыполнения);
КонецПроцедуры

Процедура ПолучитьОтпечаткиСертификатов(ОповещениеОЗавершении) Экспорт
	КриптографияБЭДКлиент.ПолучитьОтпечаткиСертификатов(ОповещениеОЗавершении);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
